ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
/* Based on:
 * - https://github.com/pvvx/esp8266web/blob/master/info/libs/main/startup.c
 * - https://github.com/SmingHub/Sming/blob/develop/Sming/Arch/Esp8266/Components/esp_no_wifi/app_main.c
 * - Ghidra decompilation
 */
#include <assert.h>
#include "c_types.h"
#include "spi_flash.h"
#include "osapi.h"
#include "mem.h"

#include "relib/esp8266.h"
#include "relib/xtensa.h"
#include "relib/ets_rom.h"
#include "relib/ets_timer.h"
#include "relib/relib.h"
#include "relib/hooks.h"
#include "relib/efuse_register.h"
#include "relib/phy_ops.h"
#include "relib/s/ieee80211_conn.h"
#include "relib/s/ieee80211com.h"
#include "relib/s/wl_profile.h"
#include "relib/s/phy_init_ctrl.h"
#include "relib/s/partition_item.h"
#include "relib/s/spi_flash_header.h"

#define BOOT_CLK_FREQ   52000000
#define NORMAL_CLK_FREQ 80000000
#define UART_BAUDRATE   115200

#if 0
#define DPRINTF(...) do { \
	ets_printf(__VA_ARGS__); \
	while ((UART0->STATUS & 0xff0000) != 0); \
} while (0)
#else
#define DPRINTF(...)
#endif

typedef struct { // Sector flash addr flashchip->chip_size-0x1000
	uint8_t bank;       // +00 = 0, 1 // WiFi config flash addr: 0 - flashchip->chip_size-0x3000 (0x7D000), 1 - flashchip->chip_size-0x2000
	uint8_t unknown[3];
	uint32_t magic1;    /* 0x55AA55AA to mark the struct as valid (0xffffffff if sector is erased) */
	uint32_t wr_cnt;    /* number of erase/write cycles so far */
	uint32_t chklen[2]; /* number of wl_profile_s bytes to checksum over */
	uint32_t chksum[2]; /* checksum of the saved wl_profile_s */
	uint32_t magic2;    /* 0xAA55AA55 to mark the struct as valid (ensure all bytes of the struct were written to flash) */
} wifi_flash_header_st;
static_assert(sizeof(wifi_flash_header_st) == 0x20, "wifi_flash_header size mismatch");

typedef struct __attribute__((packed)) {
	uint32_t addr;
} ip_addr_st;
static_assert(sizeof(ip_addr_st) == 4, "ip_addr size mismatch");

typedef struct __attribute__((packed)) {
	ip_addr_st ip;
	ip_addr_st netmask;
	ip_addr_st gw;
} ip_info_st;
static_assert(sizeof(ip_info_st) == 12, "ip_info size mismatch");

typedef struct __attribute__((packed)) {
	ip_info_st softap_info;
	ip_info_st sta_info;
	uint8 softap_mac[6];
	uint8 sta_mac[6];
} if_param_st;
static_assert(sizeof(if_param_st) == 0x24, "if_param size mismatch");

typedef struct {
	uint32_t flag;
	uint32_t exccause;
	uint32_t epc1;
	uint32_t epc2;
	uint32_t epc3;
	uint32_t excvaddr;
	uint32_t depc;
} rst_info_st;
static_assert(sizeof(rst_info_st) == 0x1c, "rst_info size mismatch");

typedef struct __attribute__((packed)) {
	union {
		uint8_t pad[0x274];
		struct {
			uint8_t pad1[0x80];
			uint8_t rx_gain_dc_table[0x100]; /* exact size not yet clear */
		};
	};
} rf_cal_st;
static_assert(sizeof(rf_cal_st) == 0x274, "rf_cal size mismatch");

typedef struct __attribute__((packed)) {
	esp_init_data_default_st esp_init;
	union {
		rf_cal_st rf_cal;
	};
} phy_init_and_rf_cal_st;
static_assert(sizeof(phy_init_and_rf_cal_st) == (0x2f4), "phy_init_and_rf_cal_st size mismatch");
static_assert(OFFSET_OF(phy_init_and_rf_cal_st, rf_cal.rx_gain_dc_table) == 0x100, "rx_gain_dc_table offset mismatch");

bool system_correct_flash_map(void); /* always returns false, weak symbol? */
bool system_rtc_mem_read(uint8_t src_addr, void *des_addr, uint16_t load_size);
bool system_rtc_mem_write(uint8_t des_addr, const void *src_addr, uint16_t save_size);
int flash_data_check(uint8_t *src);
int phy_check_data_table(void * gdctbl, int x, int flg);
int read_macaddr_from_otp(uint8_t *mac);
int system_param_sector_start;
int user_iram_memory_is_enabled(void);
int wifi_mode_set(int mode);
int wifi_station_start(void);
int wifi_softap_start(int);
int wifi_softap_stop(int);
bool wifi_station_connect(void);
uint8_t wifi_station_get_auto_connect(void);
uint8_t esp_crc8(uint8_t *src, int len);
void chip_init(esp_init_data_default_st *init_data, uint8_t *mac);
void chip_v6_set_chan_offset(int, int);
void espconn_init(void);
void load_non_32_wide_handler(xtos_exception_frame_t *ef, int cause);
void lwip_init(void);
void netif_set_default(struct netif *netif);
void phy_afterwake_set_rfoption(int opt);
uint32_t phy_get_bb_evm(void);
void rom_i2c_writeReg(uint8_t block, uint8_t host_id, uint8_t reg_add, uint8_t data);
void sleep_reset_analog_rtcreg_8266(void);
void spi_flash_clk_sel(int speed);
void sys_check_timeouts(void *timer_arg);
void system_save_sys_param(void);
void system_uart_de_swap(void);
void system_uart_swap(void);
void system_restart_local(void);
void uart_div_modify(uint8 uart_no, uint32 DivLatchValue);
void user_fatal_exception_handler(xtos_exception_frame_t *ef, int cause);
void user_init(void);
void user_init_default_profile(void);
void user_local_init(void);
void user_pre_init(void);
void user_spi_flash_dio_to_qio_pre_init(void);
void user_start(void);
void user_uart_wait_tx_fifo_empty(uint32_t ch, uint32_t wait_micros);
void user_uart_write_char(char c);
void wdt_init(int enable_hw_watchdog);
void wifi_set_backup_mac(const uint8_t *src);
void wifi_softap_cacl_mac(uint8_t *dst, const uint8_t *src);
void write_data_to_rtc(uint8_t*);
void get_data_from_rtc(uint8_t*);
void wifi_param_save_protect_with_check(uint16_t startsector, int sectorsize, void *pdata, uint16_t len);

typedef void (*init_done_cb_t)(void);

extern rst_info_st rst_if; /* user_interface.o */
extern if_param_st info; /* defined in app_main.c */
extern ieee80211com_st g_ic; /* defined in ieee80211.c */
extern uint16_t lwip_timer_interval; /* app_main.o */
extern uint8_t _bss_start;
extern uint8_t _bss_end;
extern uint32_t system_phy_init_sector; /* app_main.o */
extern uint32_t system_rf_cal_sector; /* app_main.o */
extern ETSTimer check_timeouts_timer; /* app_main.o */
extern uint8_t *phy_rx_gain_dc_table; /* phy_chip_v6.o */
extern uint8_t freq_trace_enable; /* app_main.o */
extern uint16_t TestStaFreqCalValInput; /* ieee80211_scan.o */
extern uint16_t TestStaFreqCalValDev; /* ieee80211_scan.o */
extern uint8_t user_init_flag; /* app_main.o */
extern init_done_cb_t done_cb; /* user_interface.o */

#if 1
/* Test: These support functions for ISSI and GD25Q32C are not small.
 * Since my flash is Winbond, it should work fine wihtout them.
 * This reduces the irom0text size from 28928 to 27696 (~1.2KiB / 4.2%).
 */
void spi_flash_issi_enable_QIO_mode(void) { }
void flash_gd25q32c_read_status(void) { }
void flash_gd25q32c_write_status(void) { }
#endif

/* Cache_Read_Enable:
  mb_region = 0, odd_even = 0 -> map first 8Mbit of flash
  mb_region = 0, odd_even = 1 -> map second 8Mbit of flash
  mb_region = 1, odd_even = 0 -> map third 8Mbit of flash
  mb_region = 1, odd_even = 1 -> map fourth 8Mbit of flash
  cache_size:
     SOC_CACHE_SIZE 0 // 16KB
     SOC_CACHE_SIZE 1 // 32KB
 */
void Cache_Read_Enable(uint8_t odd_even, uint8_t mb_region, uint8_t cache_size);
void Cache_Read_Disable(void);

