ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
static bool cache_map;

static void
relib_reset_uart_baud(int clk)
{
	/* Wait for UART tx fifo to drain */
	while ((UART0->STATUS & 0xff0000) != 0);
#if 0
	/* Upclock PLL to 80MHz AHB freq */
	rom_i2c_writeReg(103, 4, 1, 0x88);
	rom_i2c_writeReg(103, 4, 2, 0x91);
	/* uart_div_modify also resets the fifos, but we already flushed it */
	UART0->CLKDIV = NORMAL_CLK_FREQ / UART_BAUDRATE;
	/* Wait a bit for clock to stabilize */
	ets_delay_us(1000);
#else
	UART0->CLKDIV = clk / UART_BAUDRATE;
#endif
}

extern int chip_version;

int ICACHE_FLASH_ATTR
get_chip_version(void)
{
	if (chip_version == -1) {
		uint32_t x;
		if (EFUSE->DATA[2] & 0x8000) {
			x = EFUSE->DATA[1];
		} else {
			x = EFUSE->DATA[3];
		}
		chip_version = (x >> 24) & 0xf;
	}

	return chip_version;
}

void ICACHE_FLASH_ATTR
sleep_opt_8266(uint32_t r1, uint32_t sw_reset, uint32_t reset_ctl)
{
	RTC->R40 = 0;
	RTC->R44 = r1;
	RTC->SW_RESET = sw_reset;
	RTC->RESET_CTL = reset_ctl;
}

void ICACHE_FLASH_ATTR
sleep_opt_bb_on_8266(void)
{
	if (get_chip_version() == 2) {
		sleep_opt_8266(0, 0, 0x00800000);
	} else {
		sleep_opt_8266(0, 0, 0x00800050);
	}
}

void ICACHE_FLASH_ATTR
pm_wakeup_opt(uint32_t reg18, uint32_t rega8)
{
	RTC->WAKEUP_HW_CAUSE_REG = (RTC->WAKEUP_HW_CAUSE_REG & ~0x3f) | reg18;
	RTC->RA8 = (RTC->RA8 & ~1) | rega8;
}

void ICACHE_FLASH_ATTR
pm_set_pll_xtal_wait_time(void)
{
	if (get_chip_version() < 2) {
		RTC->XTAL_WAIT_TIME = 0xc8064;
	} else {
		RTC->XTAL_WAIT_TIME = 0x3203c;
	}
}

extern uint8_t periodic_cal_sat;

void ICACHE_FLASH_ATTR
pm_set_sleep_cycles(int rtc_cycles)
{
	/* Set the target value of RTC_COUNTER for wakeup from light-sleep/deep-sleep */
	RTC->SLP_VAL /* target */ = rtc_cycles + RTC->SLP_CNT_VAL /* current count */;
	periodic_cal_sat = 5000 < rtc_cycles;
}

extern uint8_t software_slp_reject;;
extern uint8_t hardware_reject;

void ICACHE_FLASH_ATTR
pm_wait4wakeup(int param)
{
	if (!(((param == 1) || (param == 2)) && (software_slp_reject == 0))) {
		return;
	}
	while ((RTC->SLP_STATE & 3) == 0);
	hardware_reject = RTC->SLP_STATE & 2;
}

void ICACHE_FLASH_ATTR
sleep_reset_analog_rtcreg_8266(void)
{
	RTC->INT_CLR = 0xffffffff;
	sleep_opt_bb_on_8266();
	pm_wakeup_opt(8,0);
	pm_set_pll_xtal_wait_time();
	pm_set_sleep_cycles(1000);

	RTC->SLP_CTL |= 0x100000; /* trigger wakeup? */
	pm_wait4wakeup(2);

	RTC->SW_RESET = 0x0019c06a;

	/* Note: This overrides the value set by pm_set_sleep_cycles() above */
	RTC->SLP_VAL = 0xfff;
	RTC->SLP_CTL = 0;

	/* Note: This overrides the value set by pm_set_pll_xtal_wait_time() above */
	RTC->XTAL_WAIT_TIME = 0x640c8;

	RTC->RESET_CTL = 0xf0000000;
	RTC->WAKEUP_HW_CAUSE_REG = 4;
	RTC->INT_ENA = 0;
	RTC->R40 = 0;
	RTC->R44 = 0;
	RTC->R48 = 0x20302020;
	RTC->R4C = 0x20500000;
	RTC->R58 = 0;
	RTC->R5C = 7;
	RTC->R60 = 7;
	RTC->R64 = 0;
	RTC->GPIO_OUT = 0;
	RTC->GPIO_ENABLE = 0;
	RTC->R80 = 0;
	RTC->GPIO_CONF = 0;
	RTC->R94 = 0;
	RTC->R98 = 0;
	RTC->R9C = 0;
	RTC->XPD_DCDC_CONF = 0;
	RTC->RA8 = 0;
	RTC->RAC = 0;
	RTC->RB0 = 0;
	RTC->RB4 = 0;
}

static bool
userbin_check(struct boot_hdr *bhdr)
{
	if (bhdr->use_bin == 1) {
		if (bhdr->boot_status == 0) {
			return 0;
		}
	} else if (bhdr->boot_status != 0) {
		return 0;
	}
	return 1;
}

void
Cache_Read_Enable_New(void)
{
	int user_iram = user_iram_memory_is_enabled(); /* returns 0, weak symbol? */
	Cache_Read_Enable(cache_map, 0, !user_iram);
}

static const char *exceptions[30] = {
	"IllegalInstructionCause",
	"SyscallCause",
	"InstructionFetchErrorCause",
	"LoadStoreErrorCause",
	"Level1InterruptCause",
	"AllocaCause",
	"IntegerDivideByZeroCause",
	"Reserved",
	"PrivilegedCause",
	"LoadStoreAlignmentCause",
	"Reserved10",
	"Reserved11",
	"InstrPIFDateErrorCause",
	"LoadStorePIFDataErrorCause",
	"InstrPIFAddrErrorCause",
	"LoadStorePIFAddrErrorCause",
	"InstTLBMissCause",
	"InstTLBMultiHitCause",
	"InstFetchPrivilegeCause",
	"Reserved19",
	"InstFetchProhibitedCause",
	"Reserved21",
	"Reserved22",
	"Reserved23",
	"LoadStoreTLBMissCause",
	"LoadStoreTLBMultiHitCause",
	"LoadStorePrivilegeCause",
	"Reserved27",
	"LoadProhibitedCause",
	"StoreProhibitedCause",
};

void ICACHE_FLASH_ATTR
ets_fatal_exception_handler(xtos_exception_frame_t *ef, int cause)
{
	uint32_t excvaddr = RSR(EXCVADDR);
	os_printf_plus("Fatal exception %d (%s)\n", cause, exceptions[cause]);
	os_printf_plus("epc=%08x excvaddr=%08x ps=%08x\n",
		ef->epc, excvaddr, ef->ps);
	os_printf_plus("a0=%08x a2=%08x a3=%08x a4=%08x a5=%08x a6=%08x\n",
		ef->a0, ef->a2, ef->a3, ef->a4, ef->a5, ef->a6);

	RTC->STORE[0] = 2;
#if 1
	while (1);
#else
	system_rtc_mem_write(false, &exc_regs, 0x1c);
	system_restart_local();
#endif
}

void
user_fatal_exception_handler(xtos_exception_frame_t *ef, int cause)
{
	LOCK_IRQ_SAVE();
	Wait_SPI_Idle(flashchip);
	Cache_Read_Enable_New();
	ets_fatal_exception_handler(ef, cause);
}

static uint8_t
system_get_checksum(void *src, int len)
{
	uint8_t csum = 0xef;
	uint8_t *p = src;

	while (len--) {
		csum ^= *p++;
	}
	return csum;
}

static void
print_system_param_sectors(int start_sector)
{
	ets_printf("system param error, use last saved param!\n");
}

static void
init_bss_data(void)
{
	/* Zero BSS section */
	ets_bzero(&_bss_start, &_bss_end - &_bss_start);
}

int ICACHE_FLASH_ATTR
relib_read_macaddr_from_otp(uint8_t *mac) /* impl. from RTOS SDK */
{
	uint32_t efuse[4];

	uint8_t efuse_crc = 0;
	uint8_t calc_crc = 0;
	uint8_t version;
	uint8_t use_default = 1;

	efuse[0] = EFUSE->DATA[0];
	efuse[1] = EFUSE->DATA[1];
	efuse[2] = EFUSE->DATA[2];
	efuse[3] = EFUSE->DATA[3];

	mac[3] = efuse[1] >> 8;
	mac[4] = efuse[1];
	mac[5] = efuse[0] >> 24;

	if (efuse[2] & EFUSE_IS_48BITS_MAC) {
		uint8_t tmp_mac[4];

		mac[0] = efuse[3] >> 16;
		mac[1] = efuse[3] >> 8;
		mac[2] = efuse[3];

		use_default = 0;

		tmp_mac[0] = mac[2];
		tmp_mac[1] = mac[1];
		tmp_mac[2] = mac[0];

		efuse_crc = efuse[2] >> 24;
		calc_crc = esp_crc8(tmp_mac, 3);

		if (efuse_crc != calc_crc)
			use_default = 1;

		if (!use_default) {
			version = (efuse[1] >> EFUSE_VERSION_S) & EFUSE_VERSION_V;

			if (version == EFUSE_VERSION_1 || version == EFUSE_VERSION_2) {
				tmp_mac[0] = mac[5];
				tmp_mac[1] = mac[4];
				tmp_mac[2] = mac[3];
				tmp_mac[3] = efuse[1] >> 16;

				efuse_crc = efuse[0] >> 16;
				calc_crc = esp_crc8(tmp_mac, 4);

				if (efuse_crc != calc_crc)
					use_default = 1;
			}
		}
	}

	if (use_default) {
		mac[0] = 0x18;
		mac[1] = 0xFE;
		mac[2] = 0x34;
	}

