ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
	install_task_hooks();

	wifi_mode_set(g_ic.ic_profile.opmode);
	if ((uVar4 == '\x01') || (uVar4 == '\x03')) {
		wifi_station_start();
	}
	if (uVar4 == '\x02') {
		if (g_ic.ic_mode == '\x02') {
			wifi_softap_start(1);
			goto LAB_4022f927;
		}
	}
	else if (uVar4 != '\x03') goto LAB_4022f927;
	wifi_softap_start(0);
LAB_4022f927:
	if (uVar4 == '\x01') {
		netif_set_default(g_ic.ic_if0_conn->ni_ifp);
	}
	iVar5 = wifi_station_get_auto_connect();
	if (iVar5 == 1) {
		wifi_station_connect();
	}
	if (done_cb != (init_done_cb_t)0x0) {
		done_cb();
	}
	return;
}
#endif

uint32_t
phy_get_bb_evm(void)
{
	I2C_SAR->reg048 &= 0xfffffffe;
	if (((EFUSE->DATA[2] >> 0xc) & 10) == 10) {
		BB->reg574 = 0xe690a568;
	}
	else {
		BB->reg574 = 0xeab4d027;
	}
	return BB->EVM >> 0x10 & 0x1fff;
}

void
fix_cache_bug(void)
{
	Cache_Read_Disable();
	phy_get_bb_evm();
	Cache_Read_Enable_New();
}

void phy_get_romfunc_addr(void);
void set_crystal_uart(void);
void ant_switch_init(void);
void phy_gpio_cfg(void);
void tx_cont_dis(void);
int register_chipv6_phy_init_param(esp_init_data_default_st *init_data);
int rtc_mem_check(int);
int rtc_mem_backup(uint8_t *mem_start, uint8_t *mem_end, uint32_t rtc_ram_off);
int rtc_mem_recovery(uint8_t *mem_start, uint8_t *mem_end, uint32_t rtc_ram_off);
void reduce_current_init(void);
void register_phy_ops(phy_ops_st *phy_ops);
void chip_v6_set_chan(int chan);
void sleep_set_rxpbus(int arg);
void phy_version_print(void);

extern chip6_phy_init_ctrl_st chip6_phy_init_ctrl;
extern chip6_sleep_params_st chip6_sleep_params;
extern uint8_t phy_in_most_power;
extern uint16_t phy_freq_offset;
extern uint8_t init_rf_no_cal;
extern uint8_t rx_table_renew_en;
extern uint32_t test_print_time;

int chip_v6_rf_init(int ch, int n);
int chip_v6_set_chanfreq(int chfr);
void chip_v6_set_chan(int ch);
int chip_v6_unset_chanfreq(void);
void rom_chip_v5_disable_cca(void);
void rom_chip_v5_enable_cca(void);
int chip_v6_initialize_bb(void);
void chip_v6_set_sense(void);

static const phy_ops_st phy_ops = {
	chip_v6_rf_init,
	chip_v6_set_chanfreq,
	chip_v6_set_chan,
	chip_v6_unset_chanfreq,
	rom_chip_v5_enable_cca,
	rom_chip_v5_disable_cca,
	chip_v6_initialize_bb,
	chip_v6_set_sense,
};

int ICACHE_FLASH_ATTR
register_chipv6_phy(esp_init_data_default_st *init_data)
{
	bool bVar1;
	bool bVar2;
	bool bVar3;
	bool bVar4;
	bool bVar5;
	bool bVar6;
	bool bVar7;
	int iVar8;
	int iVar9;
	bool bVar10;
	uint32_t uVar11;
	uint32_t uVar12;
	char local_40;
	uint32_t uStack_3c;
	uint32_t uStack_38;
	int iStack_30;
	static bool initdone = 0;

	fix_cache_bug();
	phy_get_romfunc_addr();
	if (!initdone) {
		iStack_30 = register_chipv6_phy_init_param(init_data);
		phy_in_most_power = chip6_phy_init_ctrl.target_power_init[0];
	}
	else {
		iStack_30 = 0;
		local_40 = chip6_sleep_params._48;
	}
	set_crystal_uart();
	ant_switch_init();
	if (!initdone) {
		phy_gpio_cfg();
	}
	tx_cont_dis();
	if ((!initdone) && ((chip6_phy_init_ctrl._76 & 0xc) != 0)) {
		phy_freq_offset = (int)chip6_phy_init_ctrl.freq_offset << 3;
	}
	uVar11 = (uint32_t)chip6_phy_init_ctrl._78;
	if (uVar11 == 2) {
		uVar11 = 1;
		chip6_phy_init_ctrl._78 = '\x01';
	}
	uVar12 = RTC->STORE[3] & 0xff;
	if (uVar12 == 0) {
		uVar12 = uVar11;
	}
	bVar4 = true;
	if ((uVar12 != 0) && (uVar12 != 1)) {
		bVar4 = false;
	}
	bVar2 = false;
	bVar1 = uVar12 == 2;
	if ((((RTC->RESET_HW_CAUSE_REG & 7) == 2) && (!initdone)) &&
		 (RTCMEM->SYSTEM[0] == 5)) {
		bVar2 = true;
	}
	bVar5 = !initdone && !bVar2;
	bVar3 = false;
	if (((bVar4) || (bVar1)) && (bVar5)) {
		bVar3 = true;
	}
	if (bVar3) {
		/* Copy 128 bytes of rfcal data to RTCMEM->BACKUP[0x00 .. 0x1f] */
		write_data_to_rtc((uint8_t *)(init_data + 0x80));
	}
	if (!initdone) {
		/* Validate the ID in the rfcal data matches EFUSE ID */
		uStack_3c = (EFUSE->DATA[2] & 0xf000) << 0x10 | EFUSE->DATA[1] & 0xfffffff;
		uStack_38 = EFUSE->DATA[0] & 0xff000000 | EFUSE->DATA[3] & 0xffffff;
		bVar3 = true;
		if ((uStack_3c == RTCMEM->BACKUP[0x60/4]) && (uStack_38 == RTCMEM->BACKUP[0x64/4])) {
			bVar3 = false;
		}
	}
	else {
		bVar3 = false;
	}
	uVar11 = RTCMEM->BACKUP[0x6c/4] >> 0x10 & 0xff;
	if (bVar2) {
		bVar1 = uVar11 == 2 || bVar1;
	}
	bVar6 = uVar11 == 4;
	if (!initdone) {
		if (bVar2) {
			uVar12 = RTCMEM->BACKUP[0x6c/4] & 0xffff;
			if ((chip6_phy_init_ctrl._72 == 0) || (uVar11 != 0)) {
				uVar11 = uVar12 + 1 & 0xffff;
			}
			else if (uVar12 < chip6_phy_init_ctrl._72) {
				bVar1 = true;
				uVar11 = uVar12 + 1 & 0xffff;
			}
			else {
				uVar11 = 0;
			}
		}
		else {
			uVar11 = 0;
		}
		RTCMEM->BACKUP[0x6c/4] = RTCMEM->BACKUP[0x6c/4] & 0xffff0000 | uVar11;
	}
	bVar10 = true;
	if (((((!bVar4) && (!bVar1)) || (initdone != '\0')) || (bVar2 && bVar6)
			) && ((initdone != '\x01' || ((~chip6_sleep_params._0_4_ & 0xff0000) == 0)))) {
		bVar10 = false;
	}
	if (bVar10) {
		iVar8 = rtc_mem_check(1);
		bVar7 = true;
		if ((iVar8 == 0) && (!bVar3)) {
			bVar7 = false;
		}
		if (bVar7) {
			bVar10 = false;
		}
	}
	if (bVar10) {
		chip6_sleep_params._96_4_ = rtc_mem_recovery((uint8_t *)&chip6_sleep_params,&chip6_sleep_params._83,0);
		rtc_mem_recovery(&chip6_sleep_params._84,&chip6_sleep_params._93,chip6_sleep_params._96_4_);
		if (!initdone) {
			if (bVar1) {
				if (bVar5) {
					chip6_sleep_params._0_4_ = chip6_sleep_params._0_4_ & 0xffbfffff;
				}
			}
			else if (bVar4) {
				chip6_sleep_params._0_4_ = 0x200000;
				chip6_sleep_params._46_2_ = 0xfe80;
			}
		}
	}
	init_rf_no_cal = 0;
	if ((bVar10) && (bVar1)) {
		init_rf_no_cal = 1;
	}
	iVar9 = phy_check_data_table(phy_rx_gain_dc_table,0x7d,1);
	iVar8 = WDEV->MICROS;
	rx_table_renew_en = '\x01';
	if ((iVar9 == 0) && ((chip6_sleep_params._0_4_ >> 0x10 & 1) != 0)) {
		rx_table_renew_en = '\0';
	}
	if (bVar2 && bVar6) {
		reduce_current_init();
	}
	else {
		register_phy_ops(&phy_ops);
	}
	test_print_time = WDEV->MICROS - iVar8;
	if (rx_table_renew_en != '\0') {
		phy_check_data_table(phy_rx_gain_dc_table,0x7d,0);
	}
	if (initdone == '\x01') {
		if ((chip6_sleep_params._0_4_ >> 0x1b & 1) == 0) {
			chip_v6_set_chan((int)local_40);
		}
	}
	else if (!bVar2 || !bVar6) {
		chip6_sleep_params._96_4_ = rtc_mem_backup((uint8_t *)&chip6_sleep_params,&chip6_sleep_params._83,0);
		rtc_mem_backup(&chip6_sleep_params._84,&chip6_sleep_params._93,chip6_sleep_params._96_4_);
		RTCMEM->BACKUP[0x60/4] = uStack_3c;
		RTCMEM->BACKUP[0x64/4] = uStack_38;
		rtc_mem_check(0);
		chip6_sleep_params._0_4_ = chip6_sleep_params._0_4_ | 0x2000000;
	}
	RTCMEM->BACKUP[0x7c/4] = RTCMEM->BACKUP[0x7c/4] & 0xffff | 0x4840000;
	if ((!bVar10) && (bVar5)) {
		get_data_from_rtc((uint8_t *)(init_data + 0x80));
	}
	/* Testmodes modifying "clear channel assesment" (CCA) regs
	if (chip6_phy_init_ctrl._59 == '\x03') {
		_DAT_60009b64 = _DAT_60009b64 & 0xfff00fff | (uint32_t)chip6_phy_init_ctrl._58 << 0xc;
	}
	if (chip6_phy_init_ctrl._59 == '\x04') {
		_DAT_60009b64 = _DAT_60009b64 & 0xfff00fff | (uint32_t)chip6_phy_init_ctrl._58 << 0xc;
		_DAT_60009d68 = _DAT_60009d68 | 0x40000;
	}
	if (chip6_phy_init_ctrl._60 == '\x02') {
		_DAT_3ff20400 = 0x55555555;
	}
	*/
	if ((chip6_sleep_params._0_4_ >> 0x1b & 1) != 0) {
		sleep_set_rxpbus(1);
	}
	if (!initdone) {
		phy_version_print();
	}
	initdone = 1;
	return iStack_30;
}

void
relib_user_start(void)
{
	spi_flash_header_st flash_hdr;
	wifi_flash_header_st hbuf;
	/* Quite a bit of stack usage here for wscfg.
	 * Fortunately we * have ~5KiB of stack at this point. */
	wl_profile_st wscfg;
	int flash_speed;
	int flash_size;
	int strap = (GPIO->IN >> 16) & 7;

	/* early uart baud init */
	relib_reset_uart_baud(BOOT_CLK_FREQ);

	/* From https://github.com/esp8266/Arduino/issues/8657 this is
	 * related to flash compatibility (`fix_cache_bug` in the NONOS SDK). */
	phy_get_bb_evm();

	ets_install_putc1(user_uart_write_char);
	DPRINTF("\nrelib_user_start:\n");

